Autodesk.Revit.DB.RevitLinkGraphicsSettings.LineWeights
The line weights of RevitLinkGraphicsSettings.
The line weights can be set to Autodesk.Revit.DB.LinkVisibility.ByHostView or Autodesk.Revit.DB.LinkVisibility.ByLinkView.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Disallowed LinkVisibility value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027